package Practice;

public class ch4practice {
    public static void main(String[] args) {
//문제 1: 정수형으로 구성된 길이 5의 배열을 선언하고, 인덱스 2의 요소에 7을 할당하고 출력하세요.
//
//문제 2: 문자열로 구성된 길이 3의 배열을 선언하고, 각 요소에 "Java", "Python", "C++"을 할당하고 출력하세요.
//
//문제 3: 실수형으로 구성된 길이 4의 배열을 선언하고, 사용자로부터 값을 입력받아 각 요소에 할당하고 출력하세요.
//
//문제 4: 정수형으로 구성된 길이 7의 배열을 선언하고, 1부터 7까지의 숫자를 할당하고 출력하세요.
//
//(오류문제) 문제 5: 정수형으로 구성된 길이 6의 배열을 선언하고, 1부터 6까지의 숫자 중 짝수만 할당하고 출력하세요.
//
//문제 6: 정수형으로 구성된 길이 5의 배열을 선언하고, 모든 요소를 0으로 초기화하고 출력하세요.
//
//문제 7: 정수형으로 구성된 길이 4의 배열을 선언하고, 사용자로부터 4개의 정수를 입력받아 배열에 할당하고, 배열의 모든 요소의 합을 출력하세요.
//
//문제 8: 정수형으로 구성된 길이 5의 배열을 선언하고, 사용자로부터 5개의 정수를 입력받아 배열에 할당하고, 배열에서 가장 큰 값과 가장 작은 값을 출력하세요.
//
//문제 9: 문자열로 구성된 길이 5의 배열을 선언하고, 사용자로부터 5개의 이름을 입력받아 배열에 할당하고, 배열을 알파벳순으로 정렬하여 출력하세요.
//
//문제 10: 정수형으로 구성된 길이 6의 배열을 선언하고, 사용자로부터 6개의 정수를 입력받아 배열에 할당하고, 배열의 요소 중 홀수의 개수를 출력하세요.
    }
}
